package com.ocp.rabbit.repository.tool.algorithm.number;

/**
 * 将数字符号转为数字
 * 
 * @author yu.yao 2018年8月13日
 *
 */
public class NumberHandler {
  static String[] testValueString =
      {"", "一", "十一", "二十一", "一百零一万零一百零一", "一万零一百", "一百一十一亿一千一百二十三万四千五百六十七", "一百二十三万四千五百六十七", "一万",
          "一千一百", "一亿一千一百二十三万四千五百六十七", "5千万", "一百二十三", "一百", "一万零一百一十一", "一百一十", "322.111",
          "一亿一千一百一十一万一千一百一十一亿一千一百二十三万四千五百六十七", "七", "一千零一", "一万零一十一", "十一亿一千一百二十三万四千五百六十七",
          "一万一千一百一十一", "十", "三", "一千一百一十一亿一千一百二十三万四千五百六十七", "一亿零一百零一万零一百零一", "九", "一万一千零一", "三五六",
          "三五六零", "零", "四万三千五百二十一", "二", "一千二百三十", "一万零一", "二十", "一百零一", "一千二百零三", "三千五百二十三",
          "三千五百零八", "一万一千一百", "一千万零一", "一千一百二十三万四千五百六十七", "一千零一十一万零一百零一", "四", "六", "一万零一百一十", "八",
          "十一万一千一百一十一亿一千一百二十三万四千五百六十七", "一万一千", "零零五十", "五", "一千", "七十五亿八百零七万九千二百零八", "一万零一十",
          "十万零三百五十六", "一百万零一", "十二万三千四百五十六", "十万零三千六百零九", "十万零二千三百四十五", "一万一千一百一十一亿一千一百二十三万四千五百六十七",
          "一亿零一", "一万一千一百一十", "一千零二十三", "一千零一十", "一万零三十", "三千五百二十一", "一万一千一百零一", "一万零一百零一", "3.5仟万",
          "一万一千零一十一", "一万一千零一十", "三点五", "1345.", ".6788", "0.000123", "3.454万", "零零五十"

      };
  static double[] testValueDouble = {0.0, 1.0, 11.0, 21.0, 1010101.0, 10100.0, 1.1111234567E10,
      1234567.0, 10000.0, 1100.0, 1.11234567E8, 5.0E7, 123.0, 100.0, 10111.0, 110.0, 322.111,
      1.1111111111234568E16, 7.0, 1001.0, 10011.0, 1.111234567E9, 11111.0, 10.0, 3.0,
      1.11111234567E11, 1.01010101E8, 9.0, 11001.0, 356.0, 3560.0, 0.0, 43521.0, 2.0, 1230.0,
      10001.0, 20.0, 101.0, 1203.0, 3523.0, 3508.0, 11100.0, 1.0000001E7, 1.1234567E7, 1.0110101E7,
      4.0, 6.0, 10110.0, 8.0, 1.1111111234567E13, 11000.0, 50.0, 5.0, 1000.0, 7.508079208E9,
      10010.0, 100356.0, 1000001.0, 123456.0, 103609.0, 102345.0, 1.111111234567E12, 1.00000001E8,
      11110.0, 1023.0, 1010.0, 10030.0, 3521.0, 11101.0, 10101.0, 3.5E7, 11011.0, 11010.0, 3.5,
      1345.0, 0.6788000000000001, 1.23E-4, 34540.0, 50};

  /**
   *
   * @param cnn a chinese number string we need to resmanager
   * @return
   */
  public static double convert2Double(String cnn) {
    return NumberConverter.parseNumber(cnn);
  }

  public static int convert2Int(String cnn) {
    return (int) NumberConverter.parseNumber(cnn);

  }

}
